@neuweiler could you confirm which version of TF Provider for Confluent you're using? I didn't manage to reproduce it for `0.8.0`:

1. Here's my TF configuration file
```
terraform {
  required_providers {
    confluent = {
      source  = "confluentinc/confluent"
      version = "0.8.0"
    }
  }
}

provider "confluent" {
  api_key    = var.confluent_cloud_api_key
  api_secret = var.confluent_cloud_api_secret
}

resource "confluent_service_account" "test" {
  display_name = "orders-app-sa123"
  description  = "Service Account for orders app"
}
```

2. Run `terraform apply` to create a new service account.
3. Deleted it using CLI
```
➜  demo git:(master) ✗ confluent iam service-account delete sa-nvznxv
Deleted service account "sa-nvznxv".
```
4. When I run `terraform apply` (while deleted SA is still in TF state) I can see:
```
➜  demo git:(master) ✗ terraform plan                                
confluent_service_account.test: Refreshing state... [id=sa-v73xn5]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # confluent_service_account.test will be created
  + resource "confluent_service_account" "test" {
      + api_version  = (known after apply)
      + description  = "Service Account for orders app"
      + display_name = "orders-app-sa123"
      + id           = (known after apply)
      + kind         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```
5. When I run `terraform apply`, I can see 
```
confluent_service_account.test: Refreshing state... [id=sa-nvznxv]
confluent_service_account.test: Creating...
confluent_service_account.test: Creation complete after 1s [id=sa-v73xn5]
```
6. And the only SA in TF state has `sa-v73xn5` now.

Let me know if that makes sense.